fireFoamCases/case3/case3_cylinder/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// to run fireFoam uncomment up to the other comment
numberOfSubdomains 4;

method          hierarchical;

coeffs
{
    n           (2 2 1);
}


// to run snappyHexMesh, uncomment the things below
//numberOfSubdomains 4;
//method		scotch;

// ************************************************************************* //
